app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories"
SELECT "users".* FROM "users"
---
  def index
    @stories = Story.all
    @story = Story.new
    @users = User.all

INSERT INTO "stories" ("created_at", "story", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 15 May 2014 20:24:41 UTC +00:00], ["story", "I asked a girl out and she said no"], ["updated_at", Thu, 15 May 2014 20:24:41 UTC +00:00]]
---
  def create
    @story = Story.new(story_params)
    if @story.save