app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 14 May 2014 13:11:53 UTC +00:00], ["email", "marvkilew@gmail.com"], ["name", "Marvki "], ["updated_at", Wed, 14 May 2014 13:11:53 UTC +00:00]]
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users"
---
  def show
    @user = User.find(params[:id])
    @users = User.all